Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/enforcement_and_redress/department_of_enterprise_trade_and_employment.html.txt.tmx
Source language: en
Languages: ga

source: Department of Jobs, Enterprise and Innovation
ga: An Roinn Post, Fiontar, agus Nuálaíochta

source: • Information • Where to apply
ga: • Cá háit a ndéanfaidh mé iarratas?

source: The Department of Jobs, Enterprise and Innovation is responsible for implementing and developing Government policy in the areas of enterprise, innovation, the regulation of business and the protection of workers
ga: Tá an Roinn Post, Fiontar agus Nuálaíochta freagrach as beartas an Rialtais a chur i bhfeidhm agus a fhorbairt i limistéir an fhiontair, na nuálaíochta, rialáil gnólachtaí agus cosaint oibrithe

source: These responsibilities include the registration of companies, consumer protection, industrial relations and employment conditions
ga: Ina measc na bhfreagrachtaí seo, tá clárú cuideachtaí, cosaint tomhaltóirí, caidreamh tionsclaíoch agus coinníollacha fostaíochta

source: The Department has 6 divisions including Labour Affairs
ga: Tá 6 rannán ag an Roinn, Gnóthaí Saothair ina measc

source: The role of the Labour Affairs Division is to work at national and international level to ensure employment rights are appropriate and respected
ga: Is é ról an Rannáin Ghnóthaí Saothair chun oibriú ar leibhéal náisiúnta agus idirnáisiúnta lena chinntiú go bhfuil cearta fostaíochta cuí agus go léirítear meas orthu

source: This Division includes the following units:
ga: Áirítear leis an Rannán na haonaid a leanas:

source: • Safety Health and Chemicals Policy Unit
ga: • An tAonad um Beartas Sábháilteachta, Sláinte agus Ceimiceán

source: • Labour market/EUEmployment Rights Policy
ga: • Beartas Margadh Saothair/Cearta Fostaíochta an AE

source: The Employment Permits Unit administers the employment permits system
ga: Riarann an tAonad Ceadanna Fostaíochta an córas ceadanna fostaíochta

source: In January 2011 the Redundancy Payments Section and the Insolvency Payments Section were transferred from this division to the Department of Social Protection
ga: In Eanáir 2011, aistríodh an Rannóg Íocaíochtaí Iomarcaíochta agus an Rannóg Íocaíochtaí Dócmhainneachta ón rannán seo go dtí an Roinn Coimirce Sóisialaí

source: The work of the Industrial Relations Section includes: industrial relations legislation, trade union matters, monitoring of industrial disputes, policy issues relating to the national minimum wage and legislation relating to employee involvement in the workplace
ga: I measc obair na Rannóige Caidrimh Thionsclaíoch, tá an méid a leanas: reachtaíocht chaidrimh thionsclaíoch, ceisteanna ceardchumainn, monatóireacht a dhéanamh ar dhíospóidí tionsclaíocha, saincheisteanna beartais a bhaineann leis an bpá náisiúnta íosta agus reachtaíocht a bhaineann le rannpháirtíocht fostaithe san ionad oibre. Cá háit a ndéanfaidh mé iarratas?
